Autodesk.Revit.DB.ImportExportFileFormat.OBJ
OBJ format

Autodesk.Revit.DB.ImportExportFileFormat.AXM
AXM format

Autodesk.Revit.DB.ImportExportFileFormat.STL
STL format

Autodesk.Revit.DB.ImportExportFileFormat.PDF
PDF format

Autodesk.Revit.DB.ImportExportFileFormat.Civil3D
Civil3D format.  Obsolete.